tap "bigwig-club/brew"
tap "egoist/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jkfran/killport"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "potatolabs/git-redate"
brew "act"
brew "autocorrect"
brew "bat"
brew "beancount"
brew "python@3.9"
brew "colima"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "difftastic"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dprint"
brew "elixir"
brew "exa"
brew "fd"
brew "openjpeg"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "gost"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "httpie"
brew "jadx"
brew "jq"
brew "just"
brew "lazygit"
brew "llvm"
brew "luajit"
brew "lynx"
brew "mas"
brew "md5sha1sum"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "p7zip"
brew "pngpaste"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "proxychains-ng"
brew "pv"
brew "pyenv"
brew "python@3.10"
brew "rename"
brew "ripgrep"
brew "smartmontools"
brew "sponge"
brew "stow"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "vhs"
brew "wget"
brew "wireshark"
brew "zsh"
brew "egoist/tap/dum"
brew "jkfran/killport/killport"
brew "khanhas/tap/spicetify-cli"
brew "koekeishiya/formulae/yabai"
brew "michaeleisel/zld/zld"
cask "android-platform-tools"
cask "betterdisplay"
cask "coteditor"
cask "firefox"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "iina"
cask "kindle"
cask "kitty"
cask "lyricsx", args: { appdir: "/Applications" }
cask "maczip"
cask "monitorcontrol"
cask "phoenix"
cask "picgo"
cask "rar"
cask "raycast"
cask "snipaste"
cask "spotify"
cask "typora"
cask "xmind"
mas "MenubarX", id: 1575588022
mas "Notability", id: 360593530
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
