tap "bigwig-club/brew"
tap "cloudflare/cloudflare"
tap "egoist/tap"
tap "farion1231/ccswitch"
tap "felixkratz/formulae"
tap "fengkx/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jkfran/killport"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "krtirtho/apps"
tap "lbjlaq/antigravity-manager", "https://github.com/lbjlaq/Antigravity-Manager"
tap "lihaoyun6/tap"
tap "michaeleisel/zld"
tap "oven-sh/bun"
tap "potatolabs/git-redate"
tap "supabase/tap"
tap "wez/wezterm"
brew "act"
brew "age"
brew "aom"
brew "ast-grep"
brew "autocorrect"
brew "libgit2"
brew "bat"
brew "xz"
brew "beancount"
brew "btop"
brew "lima"
brew "colima"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "diffoscope"
brew "difftastic"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dprint"
brew "dua-cli"
brew "dufs"
brew "erlang"
brew "elixir"
brew "exiftool"
brew "eza"
brew "fcp"
brew "fd"
brew "lame"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "flyctl"
brew "fnm"
brew "fonttools"
brew "fzf"
brew "gcc"
brew "jpeg-xl"
brew "libavif"
brew "webp"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "gost"
brew "gpgme"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "httpie"
brew "icu4c@77"
brew "iredis"
brew "openjdk"
brew "jadx"
brew "jq"
brew "just"
brew "lazygit"
brew "lefthook"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "libzip"
brew "litecli"
brew "llmfit"
brew "llvm"
brew "luajit"
brew "lynx"
brew "mas"
brew "md5sha1sum", link: true
brew "mkcert"
brew "monolith"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "ollama"
brew "p7zip"
brew "pdm"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "proto"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "proxychains-ng"
brew "pv"
brew "pyenv"
brew "python-setuptools"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rush-parallel"
brew "smartmontools"
brew "sponge"
brew "sqldiff"
brew "stow"
brew "subversion"
brew "tesseract"
brew "tesseract-lang"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "typos-cli"
brew "unar"
brew "uv"
brew "vhs"
brew "vivid"
brew "watchman"
brew "wget"
brew "wxwidgets"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "cloudflare/cloudflare/cf-terraforming"
brew "egoist/tap/dum"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jkfran/killport/killport"
brew "khanhas/tap/spicetify-cli"
brew "koekeishiya/formulae/skhd"
brew "michaeleisel/zld/zld"
brew "oven-sh/bun/bun"
brew "supabase/tap/supabase"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "lbjlaq/antigravity-manager/antigravity-tools"
cask "betterdisplay"
cask "bitwarden"
cask "calibre"
cask "farion1231/ccswitch/cc-switch"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "coteditor"
cask "cursor"
cask "darktable"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-maple-mono-normal-nf-cn"
cask "font-meslo-lg-nerd-font"
cask "font-sarasa-gothic"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "hex-fiend"
cask "iina"
cask "input-source-pro"
cask "keepassxc"
cask "kindle"
cask "kitty"
cask "launchcontrol"
cask "fengkx/tap/lkdots"
cask "logseq"
cask "lunar"
cask "lyricsx", args: { appdir: "/Applications" }
cask "macdroid"
cask "maczip"
cask "makemkv"
cask "mark-text"
cask "mitmproxy"
cask "monitorcontrol"
cask "orbstack"
cask "pdfelement"
cask "phoenix"
cask "picgo"
cask "qbittorrent"
cask "lihaoyun6/tap/quickrecorder"
cask "rar"
cask "raycast"
cask "rectangle"
cask "snipaste"
cask "spotify"
cask "krtirtho/apps/spotube"
cask "squirrel-app"
cask "steam"
cask "telegram"
cask "thaw"
cask "the-unarchiver"
cask "typora"
cask "ubersicht"
cask "bigwig-club/brew/upic"
cask "virtualbox"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wechat"
cask "wireshark-app"
cask "xmind"
mas "iMovie 剪辑", id: 408981434
mas "Keynote讲演", id: 409183694
mas "MenubarX", id: 1575588022
mas "Notability", id: 360593530
mas "Numbers表格", id: 409203825
mas "Pages文稿", id: 409201541
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "库乐队", id: 682658836
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.file-nesting"
vscode "astro-build.astro-vscode"
vscode "bierner.lit-html"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "cnyballk.wxml-vscode"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "docsmsft.docs-markdown"
vscode "dprint.dprint"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fengkx.beancount-lsp-client"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "huacnlee.autocorrect"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "lencerf.beancount"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "million.million-lint"
vscode "mjohns.clang-format"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "polarmutex.beancount-langserver"
vscode "pomber.git-file-history"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tree-sitter.tree-sitter-graph"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vitest.explorer"
vscode "vunguyentuan.vscode-css-variables"
vscode "wayou.vscode-todo-highlight"
vscode "yijie.vscode-comment-queries"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/tools/gopls"
go "github.com/mitranim/gow"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
cargo "cargo-binstall"
cargo "cargo-edit"
cargo "cargo-expand"
cargo "cargo-pgrx"
cargo "cargo-release"
cargo "cargo-tarpaulin"
cargo "cargo-wasi"
cargo "cargo-watch"
cargo "git-cliff"
cargo "lkdots"
cargo "wasm-bindgen-cli"
cargo "wasm-opt"
cargo "wasm-pack"
