tap "bigwig-club/brew"
tap "egoist/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jkfran/killport"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "potatolabs/git-redate"
tap "supabase/tap"
tap "wez/wezterm"
brew "act"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "ast-grep"
brew "autocorrect"
brew "libgit2"
brew "bat"
brew "beancount"
brew "gcc"
brew "btop"
brew "freetype"
brew "cairo"
brew "qemu"
brew "lima"
brew "colima"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "difftastic"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dprint"
brew "dua-cli"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "eza"
brew "fcp"
brew "fd"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fish"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "gost"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "httpie"
brew "iredis"
brew "openjdk"
brew "jadx"
brew "jq"
brew "just"
brew "lazygit"
brew "lefthook"
brew "litecli"
brew "llvm"
brew "luajit"
brew "lynx"
brew "mas"
brew "md5sha1sum"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "p7zip"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "proxychains-ng"
brew "pv"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "rename"
brew "ripgrep"
brew "rush-parallel"
brew "smartmontools"
brew "sponge"
brew "sqldiff"
brew "stow"
brew "subversion"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "typos-cli"
brew "unar"
brew "vhs"
brew "vivid"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "egoist/tap/dum"
brew "felixkratz/formulae/sketchybar"
brew "jkfran/killport/killport"
brew "khanhas/tap/spicetify-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "supabase/tap/supabase"
cask "android-platform-tools"
cask "betterdisplay"
cask "bitwarden"
cask "calibre"
cask "coteditor"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "input-source-pro"
cask "kindle"
cask "kitty"
cask "launchcontrol"
cask "logseq"
cask "lyricsx", args: { appdir: "/Applications" }
cask "maczip"
cask "mark-text"
cask "monitorcontrol"
cask "phoenix"
cask "picgo"
cask "rar"
cask "raycast"
cask "rectangle"
cask "snipaste"
cask "spotify"
cask "squirrel"
cask "telegram"
cask "the-unarchiver"
cask "typora"
cask "ubersicht"
cask "upic"
cask "visual-studio-code"
cask "wechat"
cask "wireshark"
cask "xmind"
mas "iMovie 剪辑", id: 408981434
mas "Keynote 讲演", id: 409183694
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "库乐队", id: 682658836
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.file-nesting"
vscode "astro-build.astro-vscode"
vscode "bierner.lit-html"
vscode "blanu.vscode-styled-jsx"
vscode "bradlc.vscode-tailwindcss"
vscode "cnyballk.wxml-vscode"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docsmsft.docs-markdown"
vscode "dprint.dprint"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "huacnlee.autocorrect"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "lencerf.beancount"
vscode "lightyen.tailwindcss-intellisense-twin"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tree-sitter.tree-sitter-graph"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vunguyentuan.vscode-css-variables"
vscode "wayou.vscode-todo-highlight"
vscode "yijie.vscode-comment-queries"
vscode "zixuanchen.vitest-explorer"
