amazonwebservices.aws-toolkit-vscode@3.62.0
antfu.browse-lite@0.3.9
antfu.file-nesting@1.1.3
astro-build.astro-vscode@0.28.2
bierner.lit-html@1.11.1
blanu.vscode-styled-jsx@2.1.1
bradlc.vscode-tailwindcss@0.14.17
cnyballk.wxml-vscode@0.1.2
csstools.postcss@1.0.9
dbaeumer.vscode-eslint@3.0.10
denoland.vscode-deno@3.44.2
docker.docker@0.6.0
docsmsft.docs-markdown@1.0.13
dprint.dprint@0.13.5
dtsvet.vscode-wasm@1.4.1
eamodio.gitlens@17.1.0
ecmel.vscode-html-css@1.13.1
editorconfig.editorconfig@0.16.4
esbenp.prettier-vscode@9.10.4
fengkx.beancount-lsp-client@0.0.74
formulahendry.auto-rename-tag@0.1.10
github.codespaces@1.17.3
github.copilot@1.322.0
github.copilot-chat@0.27.1
github.github-vscode-theme@6.3.5
golang.go@0.46.1
hashicorp.terraform@2.34.3
huacnlee.autocorrect@2.6.4
humao.rest-client@0.25.1
james-yu.latex-workshop@10.9.1
lencerf.beancount@0.13.0
lightyen.tailwindcss-intellisense-twin@3.0.0
mads-hartmann.bash-ide-vscode@1.43.0
mechatroner.rainbow-csv@3.19.0
million.million-lint@1.0.14
mjohns.clang-format@1.10.0
ms-azuretools.vscode-docker@1.29.6
ms-python.black-formatter@2025.2.0
ms-python.debugpy@2025.8.0
ms-python.isort@2022.8.0
ms-python.python@2025.6.1
ms-python.vscode-pylance@2025.5.1
ms-toolsai.jupyter@2025.4.0
ms-toolsai.jupyter-keymap@1.0.0
ms-toolsai.jupyter-renderers@1.1.0
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.5
ms-vscode-remote.remote-containers@0.413.0
ms-vscode-remote.remote-ssh@0.120.0
ms-vscode-remote.remote-ssh-edit@0.84.0
ms-vscode.cmake-tools@1.20.53
ms-vscode.cpptools@1.25.3
ms-vscode.cpptools-extension-pack@1.3.1
ms-vscode.cpptools-themes@2.0.0
ms-vscode.hexeditor@1.11.1
ms-vscode.live-server@0.4.15
ms-vscode.remote-explorer@0.5.0
ms-vscode.vscode-speech@0.14.0
octref.vetur@0.36.1
orta.vscode-jest@6.4.3
pkief.material-icon-theme@5.23.0
polarmutex.beancount-langserver@1.2.5
pomber.git-file-history@1.0.1
rangav.vscode-thunder-client@2.34.4
rust-lang.rust-analyzer@0.3.2457
shopify.ruby-lsp@0.9.24
streetsidesoftware.code-spell-checker@4.0.47
sumneko.lua@3.14.0
svelte.svelte-vscode@109.8.0
syler.sass-indented@1.8.33
tamasfe.even-better-toml@0.21.2
tomoyukim.vscode-mermaid-editor@0.19.1
tree-sitter.tree-sitter-graph@0.1.1
twxs.cmake@0.0.17
undefined_publisher.beancount-lsp-client@0.0.1
unifiedjs.vscode-mdx@1.8.14
usernamehw.errorlens@3.26.0
vadimcn.vscode-lldb@1.11.4
visualstudioexptteam.vscodeintellicode-completions@2.0.1
vitest.explorer@1.18.1
vunguyentuan.vscode-css-variables@2.7.1
wayou.vscode-todo-highlight@1.0.5
yijie.vscode-comment-queries@1.2.4
