amazonwebservices.aws-toolkit-vscode@1.82.0
antfu.file-nesting@1.1.2
astro-build.astro-vscode@2.1.4
bierner.lit-html@1.11.1
blanu.vscode-styled-jsx@2.1.1
bradlc.vscode-tailwindcss@0.9.11
cnyballk.wxml-vscode@0.1.2
csstools.postcss@1.0.9
dbaeumer.vscode-eslint@2.4.2
docsmsft.docs-markdown@1.0.1
dprint.dprint@0.15.0
dtsvet.vscode-wasm@1.4.1
eamodio.gitlens@14.1.1
ecmel.vscode-html-css@1.13.1
EditorConfig.EditorConfig@0.16.4
esbenp.prettier-vscode@10.1.0
formulahendry.auto-rename-tag@0.1.10
GitHub.codespaces@1.14.14
GitHub.github-vscode-theme@6.3.4
golang.go@0.39.1
gongfeng.gongfeng-copilot@1.17.3
huacnlee.autocorrect@2.6.3
humao.rest-client@0.25.1
James-Yu.latex-workshop@9.13.3
Lencerf.beancount@0.9.1
lightyen.tailwindcss-intellisense-twin@3.0.0
mads-hartmann.bash-ide-vscode@1.39.0
mechatroner.rainbow-csv@3.7.0
ms-azuretools.vscode-docker@1.26.0
ms-python.isort@2023.10.1
ms-python.python@2023.12.0
ms-python.vscode-pylance@2023.7.40
ms-toolsai.jupyter@2023.6.1101941928
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.0.17
ms-toolsai.vscode-jupyter-cell-tags@0.1.8
ms-toolsai.vscode-jupyter-slideshow@0.1.5
ms-vscode-remote.remote-containers@0.299.0
ms-vscode-remote.remote-ssh@0.102.0
ms-vscode-remote.remote-ssh-edit@0.86.0
ms-vscode.cmake-tools@1.14.34
ms-vscode.cpptools@1.16.3
ms-vscode.cpptools-extension-pack@1.3.0
ms-vscode.cpptools-themes@2.0.0
ms-vscode.hexeditor@1.9.12
ms-vscode.live-server@0.4.9
ms-vscode.remote-explorer@0.4.1
octref.vetur@0.37.3
Orta.vscode-jest@5.2.3
PKief.material-icon-theme@4.29.0
rangav.vscode-thunder-client@2.10.0
rust-lang.rust-analyzer@0.3.1607
streetsidesoftware.code-spell-checker@2.20.5
sumneko.lua@3.6.26
svelte.svelte-vscode@107.9.0
syler.sass-indented@1.8.26
tamasfe.even-better-toml@0.19.2
tomoyukim.vscode-mermaid-editor@0.18.1
tree-sitter.tree-sitter-graph@0.1.1
unifiedjs.vscode-mdx@1.4.0
usernamehw.errorlens@3.12.0
vadimcn.vscode-lldb@1.9.2
vunguyentuan.vscode-css-variables@2.6.3
wayou.vscode-todo-highlight@1.0.5
YiJie.vscode-comment-queries@1.2.3
ZixuanChen.vitest-explorer@0.2.42
