antfu.browse-lite@0.3.9
antfu.file-nesting@1.1.3
astro-build.astro-vscode@2.15.4
bierner.lit-html@1.11.1
blanu.vscode-styled-jsx@2.1.1
bradlc.vscode-tailwindcss@0.14.19
cnyballk.wxml-vscode@0.1.2
csstools.postcss@1.0.9
dbaeumer.vscode-eslint@3.0.10
denoland.vscode-deno@3.44.2
docker.docker@0.7.0
docsmsft.docs-markdown@1.0.13
dprint.dprint@0.16.4
dtsvet.vscode-wasm@1.4.1
eamodio.gitlens@17.1.1
ecmel.vscode-html-css@2.0.13
editorconfig.editorconfig@0.17.2
esbenp.prettier-vscode@11.0.0
fengkx.beancount-lsp-client@0.0.81
formulahendry.auto-rename-tag@0.1.10
github.codespaces@1.17.3
github.copilot@1.323.0
github.copilot-chat@0.26.7
github.github-vscode-theme@6.3.5
golang.go@0.46.1
huacnlee.autocorrect@2.6.4
humao.rest-client@0.25.1
james-yu.latex-workshop@10.9.1
lencerf.beancount@0.13.0
lightyen.tailwindcss-intellisense-twin@3.0.0
mads-hartmann.bash-ide-vscode@1.43.0
mechatroner.rainbow-csv@3.19.0
million.million-lint@1.0.14
ms-azuretools.vscode-docker@1.29.6
ms-python.debugpy@2025.8.0
ms-python.isort@2025.0.0
ms-python.python@2025.6.1
ms-python.vscode-pylance@2025.5.1
ms-toolsai.jupyter@2025.3.0
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.1.0
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
ms-vscode-remote.remote-containers@0.413.0
ms-vscode-remote.remote-ssh@0.120.0
ms-vscode-remote.remote-ssh-edit@0.87.0
ms-vscode.cmake-tools@1.20.53
ms-vscode.cpptools@1.25.3
ms-vscode.cpptools-extension-pack@1.3.1
ms-vscode.cpptools-themes@2.0.0
ms-vscode.hexeditor@1.11.1
ms-vscode.live-server@0.4.15
ms-vscode.remote-explorer@0.5.0
octref.vetur@0.37.3
orta.vscode-jest@6.4.3
pkief.material-icon-theme@5.23.0
polarmutex.beancount-langserver@1.2.5
pomber.git-file-history@1.0.1
rangav.vscode-thunder-client@2.35.0
rust-lang.rust-analyzer@0.3.2466
shopify.ruby-lsp@0.9.25
streetsidesoftware.code-spell-checker@4.0.47
sumneko.lua@3.14.0
svelte.svelte-vscode@109.8.1
syler.sass-indented@1.8.33
tamasfe.even-better-toml@0.21.2
tomoyukim.vscode-mermaid-editor@0.19.1
tree-sitter.tree-sitter-graph@0.1.1
twxs.cmake@0.0.17
unifiedjs.vscode-mdx@1.8.14
usernamehw.errorlens@3.26.0
vadimcn.vscode-lldb@1.11.4
vunguyentuan.vscode-css-variables@2.7.1
wayou.vscode-todo-highlight@1.0.5
yijie.vscode-comment-queries@1.2.4
